{
    "general": {
        "terms": {
            "run cancel": "A Run Cancel allows you to use any move out of a run. It is performed by returning the Control Stick to the neutral (default) position, then performing any move.",
            "skid cancel": "A Skid Cancel, also known as RGR, is pretty much the grounded version of RAR. Due to SSBU's new dash mechanics, you can cancel a skid with any move. In turn, you can reverse your direction before any move during a dash.",
            "sh": "A Short Hop, or a SH, is performed in 2 ways in SSBU:\n\n1) Pushing the jump button, then releasing it before becoming airborne\n2) Buffering an aerial during the jump startup\n\nA SH is a shorter version of a normal jump, allowing you to hit grounded opponents and land quicker.\n\nAfter performing a SH in SSBU, your aerial damage will be reduced to 0.85x its original damage. This applies until you jump or touch the ground. It is currently unknown if this applies to specials. It is also unknown if hitting an aerial, performing a special, performing an aerial, or being hit resets this.",
            "faf": "FAF is the First Actionable Frame. It's basically the first frame you can perform an action during another one. For instance, if a move has a FAF of 24, the first frame you can act during it is frame 24, and the last frame you cannot act is frame 23.",
            "jmu": "A JMU is a __J__oint __M__atch__U__p. During one, 2 Smashcords come together to discuss the MU between their characters and is a great opportunity to learn! Each Smashcord does it differently - some structure theirs on a schedule and some don't, some end theirs with a crew battle and some don't, etc.",
            "oos": "OoS refers to your Out of Shield options, or the things you can do while shielding. These are, for any character:\n\n- Grab\n-Jump\n- JC USmash\n- JC Up Special\n- Any special used after a jump\n- Any aerial after a jump\n- Airdodge after a jump\n- Any move after a shield drop. See also: JC",
            "rar": "RAR stands for Reverse Aerial Rush. It is performed by running in one direction, then holding behind you so that you skid while facing the opposite direction. Because you can cancel this animation with a jump, you can then jump and perform aerials. This allows you to approach with a Back Air or retreat with a Forward Air, etc.",
            "rar2": "RAR stands for Reverse Aerial Rush. It's a technique that exploits how the skid animation works; you can jump during a skid, allowing you to jump out of a dash facing the opposite direction you started. This is notably useful for moving forward using a Back Aerial.",
            "rgr": "RGR, also known as a Skid Cancel, stands for Reverse Grounded Rush. It's pretty much the grounded version of RAR. Due to SSBU's new dash mechanics, you can cancel a skid with any move. In turn, you can reverse your direction before any move during a dash.",
            "frame": "A frame is the smallest unit of time in Smash. There are 60 frames per second, and the speed of moves is usually measured in frames. For instance, in Smash 4, Little Mac's Jab 1 is Frame 1, which is instant. Mario's Jab 1 is Frame 2, which is almost instant, etc. The speed of a move is often abbreviated to Fx, where x is the frame the move comes out on. For example, Little Mac's Jab would be F1 and Mario's would be F2.",
            "runbrake": "RunBrake is the technical name for a skid. This occurs when you enter Run, then return the control stick to neutral. Not to be confused with a turnaround skid, also known as a pivot, or run turnaround.",
            "fh": "A Full Hop, or a FH, is the normal type of jump. It is performed when you do not buffer an aerial on your jump startup or you hold the jump button throughout your jump startup. Using a FH allows you to hit opponents on high platforms, hit opponents far above you, followup from certain moves, etc.",
            "aa": "An AA is an anti-air, and it's basically a move that counters an aerial approach. It is typically disjointed and/or has a high hitbox. A traditional fighting game example is Ryu's Heavy Kick or Shoryuken in Street Fighter. A Smash Bros example is Cloud's Cross Slash.",
            "rage": "Rage is a mechanic that increases the knockback dealt slightly by a fighter as their percent increases. It starts taking effect at 35% and gradually became stronger, maxing at 150%. It does not affect moves with WBKB (weight based knockback). See also: wbkb",
            "wbkb": "WBKB is short for Weight Based Knockback. It is essentially set knockback, and it only changes based on a character's weight, hence the name. See also: kb, bkb, kbg",
            "sdi": "SDI is short for Smash Directional-Influence (oficially called hitstun shuffling). It is NOT DI (Directional Influence) and is a completely different mechanic. It is performed while pressing a direction repeatedly while in hitlag (also known as freeze frames). Each time you press a direction, you will move slightly in that direction **before** knockback. This allows you to escape multihit moves, such as rapid jabs.\n\nA more effective method in Smash 4 on the Gamecube Controller was to push the control stick to the notch of the direction you wanted to SDI in, then move it to the 2 notches beside it. For instance if you wanted to SDI up, you would do an input like this:\n\n⬆ ↖ ⬆ ↗ ⬆ \n\nIt is unknown if this is the most effective SDI method in SSBU.",
            "ledge grab limit": "https://www.youtube.com/watch?v=ZG-msKOIR9g",
            "shac": "Short for ShortHop Autocancel. If a move can SHAC, it means it will autocancel in a shorthop. This is generally a good property for a move to have. See also: AC",
            "hitstun shuffling": "Hitstun Shuffling is the offical name for SDI. See: sdi",
            "kb": "Knockback, abbreviated to KB, is the distance you travel when launched by a particular move. Two parts of KB are Base Knockback (BKB) and Knockback Growth (KBG). BKB is the base knockback amount that is always applied at any percent. KBG is a modifier that affects how far you are sent by an attack at higher percents. See also: bkb, kbg, wbkb",
            "zac": " A Z-drop Aerial Catch or ZAC, is performed by pressing grab while in the air to z-drop an item (like bombs), and then immediately inputting an aerial, which will recatch the bomb. The result will be a somewhat delayed aerial while holding a bomb. This can allow for some more unique combo potential.",
            "ff": "Fastfall, sometimes shortened to FF, is when you press down on the control stick after reaching the peak of your jump. This will result in you falling faster than you normally would.",
            "ac": "An Autocancel is the window during which a move can land with no additional landing lag. Most moves have an autocancel window before the move comes out and after the move has completed. If you land during this period, you will land without the aerial's extra landing lag. For example, Link's down air from very high up can land with no endlag, but if he tries to use it close to the ground, he will have a noticable amount of landing lag.",
            "b reverse": "A B-reverse happens when you do a Special move (such as side-B), and then immediately press the control stick in the opposite direction that you are facing. This will shift all your momentum from the original direction of travel into the new direction. Not all special moves can do this and get the momentum shift. See also: wavebounce, turnaroundspecial",
            "turnaround special": "A Turnaround Special is performed by  pressing left or right before initiating a special move. This will result in a special move facing the new direction, with no shift in momentum. See also: breverse, wavebounce",
            "wavebounce": "A Wavebounce combines the effects of a B-Reverse and a Turnaround Special. If you move to the right, for example, and do a turnaround Shorthop Lucas PK Fire to the left, but immediately input to the right after inputting the special, you will end up 'bouncing' back to the left, while shooting right. The inputs for this are jump to the right > left special > right. The timing for this is precise, and requires practice to perform reliably. See also: breverse, turnaroundspecial",
            "dad": "Directional Airdodge. Press airdodge while pressing in a direction.",
            "waveland": "A Waveland is where you airdodge down into a platform or the ground to land more quickly. The name is related to a wavedash, as both can end with you sliding on the ground.",
            "jc": "In Smash 4, a Jump Cancel, or JC, is commonly used to refer to when you jump and then cancel that jump into something else before you leave the ground. During Jumpsquat (JS), you can input an Up Special, Up Smash, or Item Toss, and it will cancel your jump into that action. Some techs like JC item toss have, in previous games, caused you to slide while tossing. JC Usmash is how you do an Usmash OOS, and JC UpB is how you can do an UpB OOS, since you can jump straight out of shielding. See also: OOS, JS",
            "js": "Jumpsquat, or JS, is the animation that you go into where you are essentially squatting before you leave the ground during a jump. When you input a jump, your character will squat for 3 frames (in ultimate). After these 3 frames you will leave the ground.",
            "bkb": "Base Knockback, or BKB for short, is the baseline knockback for a move. BKB is generally the only form of knockback seen when the opponent is hit at 0%. High BKB means that the move can knock the opponent far even at a low percent, like Marth tippers or Ganon's Warlock Punch. Low BKB has very little starting knockback, like Shiek's Fair or Most characters' Jab 1. See: kb, wbkb, kbg",
            "kbg": "Knockback Growth, or KBG, is how much knockback strength grows as the opponent takes more and more damage. High KBG means that the move will knock opponents farther sooner like most smashes. Low KBG means that the move will kill later or has a more consistant knockback, like Shiek's Fair or Mario's Utilt pre-nerf. See also: bkb, wbkb, kb",
            "di": "DI, short for Directional Influence, is a mechanic that allows you to slightly change your launch angle. This is performed by pushing the control stick perpendicular to your launch angle, and will shift it in the direction you push. In Smash 4, you could change your angle by about 9.7 degrees. DIing towards someone is usually referred to as \"DI in\" and DIing away from someone is usually referred to as \"DI out\". There are two major applications for DI- combo DI and survival DI\n\nKeep in mind there is a second mechanic you must use in conjunction with DI known as LSI. See also - Combo DI, Survival DI, LSI",
            "combo di": "Combo DI allows you to escape combos by changing your launch angle in a way that you get hit farther from the opponent. For instance, when DK uses an aerial cargo up throw, you can DI it towards him. This will place you farther from him than you would normally be, making it harder for him to connect an up air. See also - DI, Survival DI, LSI",
            "survival di": "Survival DI allows you to survive kill moves by changing your launch angle in a way that makes you take more time to reach the blast zones. For instance, against Mewtwo's up throw, you can DI away from him to survive longer. See also - DI, Combo DI, LSI",
            "lsi": "LSI, short for Launch Speed Influence, is a mechanic that allows you to change the speed you are launched at. It only applies if the launch angle is between 65 and 295 degrees. The method to perform it is simple- hold up to fly faster, hold down to fly slower! However, its applications are much more complicated. This comes from the fact that you can use both DI and LSI at the same time. This matters because *DIing down is not good* in most situations. There's 2 reasons for this: 1) DIing down makes it harder to recover, because you have less time to drift and 2) it makes you reach the blast zone quicker.\n\nTo avoid this problem, you must find the angle that takes advantage of both good DI and good LSI. On more horizontal moves, this is usually simply in, which only takes advantage of DI. On diagonal launch angles, however, this is usually down and in. The down part is for LSI, the in part is for DI. Breaking it down further, the down input slows your momentum and the in part makes you take longer to reach the blast zone.\n\nThere is another mechanic related to LSI that makes certain moves kill at much later percents- LSI is applied after DI. This means if a move launches you outside of the LSI range originally (i.e. at 70 degrees) and you DI it into the LSI range, you can also begin to LSI it. For example, Charizard's Smash 4 UThrow had an angle of 70 degrees and you could hold down and away to remove most of its kill potential. Not only is this angle perfect to bring it into LSI range, but it also DIs the *vertical* half of it, by DIing away from Charizard as well.\n\nFinally, if you played Melee, you will know the optimal survival DI for diagonal or horizontal moves was up. In SSBU, **this will kill you. Do not do it.** While this angle is the correct *DI*, it is the incorrect *LSI*. In this situation, LSI takes more effect, and you die sooner. Make sure whenever you DI something, your DI \"agrees\" with your LSI. See also - DI",
            "bnb": "Short for Bread and Butter, which is a character's main damage racking combos.",
            "cqc": "Short for close quarters combat, which is the game when two players are close to each other. Some characters are good at CQC, some are not.",
            "mu": "matchup. The discussion and understanding of how the game plays out between two specific characters.",
            "crew battle": "Crew battle. Where two groups of players play against each other in sequence. The winner of a match carries their remaining stocks over against the next opponent. Last team with stocks left wins.",
            "cb": "Crew battle. Where two groups of players play against each other in sequence. The winner of a match carries their remaining stocks over against the next opponent. Last team with stocks left wins.",
            "dashback": "When you are facing one way, and then input a dash in the other direction, it is called a dashback.",
            "atkc": "Attack Cancel. You can jump out of the startup of tilts and dash attacks which can be useful. https://youtu.be/v1kjQtMaPkE",
            "attack cancel": "Attack Cancel. You can jump out of the startup of tilts and dash attacks which can be useful. https://youtu.be/v1kjQtMaPkE"     
        },
        "data": {
            "name": "general",
            "server": "all"
        }
    },
    "Isabelle": {
        "terms": {
            "rod naming system": "Similar to DK's cargo throws, it is a system to easily abbreviate the 8 fishing rod throws. All abbreviations consist of 4 letters.\n\n1) A or G - Stands for aerial or grounded\n2) R - Stands for rod\n3) F or B or U or D - Stands for the throw direction, like normal throws\n4) T - Stands for throw\n\nFor example, a grounded rod forward throw would be GRFT.",
            "glyroid": "To Glyroid, first plant a lloid. Then, upon dashing, press down B while still holding in the direction of the dash, it will make Isabelle slide a considerable distance while doing the animation of manually triggering the mine. You cannot B-Reverse this. Found by Vinylic."
        },
        "data": {
            "name": "Isabelle",
            "server": "489939754021027841"
        }
    },
    "Young Link": {
        "terms": {
            "c4": "C4 is placing a bomb in a way that it lies on the ground without exploding. You can do this by performing either a forward toss or back toss. You can also perform it by z-dropping the bomb right after jumping or right before landing.",
            "gsa": "A gSA is a Grounded Spin Attack. When grounded, Spin Attack is a multi-hit move that acts as a combo starter. Its main followup is Uair, which can be a 50/50 within a percent range.",
            "asa": "An aSA is an Aerial Spin Attack. When aerial, Spin Attack is a multi-hit move that acts as a KO move. It can kill off the side, and its main setup is off of a Bomb.",
            "soft toss": "A soft toss is where you toss a bomb that does not explode upon hitting the ground, but rather does a little bounce and then sits there, as an item, until it explodes. This is performed by simply tossing a bomb with no directional input in front of you. To soft toss behind you, you can press tilt stick behind you, if you have the cstick set to tilt. This can be useful for a number of reasons. Our relatively short bomb timer can remain as a threat to players who are not actively keeping up with its explosion timer. In addition, if you space yourself perfectly, you can soft toss a bomb such that it bounces right off the edge of the stage, and then falls almost straight down, which can sometimes stage spike.",
            "rr": "The hitbox on Young Link's Boomerang when it starts to return to him. The Returning Boomerang hitbox has set knockback and is an excellent pressure and combo tool. Applies to all Links."
        },
        "data": {
            "name": "Young Link",
            "server": "456487360624984076"
        }
    },
    "Pichu": {
        "terms": {
            "deletchu": "UAir -> Fastfall Thunder, a kill confirm that can be set up with multiple options. Works on all DI, but the UAir has to be crossed up on DI out.",
            "lightning loops": "Using Double Jump Fastfall Autocancel (DJFFAC) BAir dragdown to combo into UTilt or UAir, which can combo into another bair, and repeat the setup. To learn more, watch this video: https://youtu.be/xJyufyRb2F4"
        },
        "data": {
            "name": "Pichu",
            "server": "421442870864510976"
        }
    },
    "Ice Climbers": {
        "terms": {
            "uaft": "Up angled forward tilt.",
            "nut": "Developed by **Iggy**\ndthrow > (roll) > ftilt > (sideb) > grab-dthrow > (roll) > nair > (sideb) > grab-dthrow > (fair).\n*Note: Nut is its own thing. It cannot be truly extended into a 0-death or many other things. https://youtu.be/KmbBGbuMTZI?t=27*",
            "yeet": "cheerless bthrow (nana fsmash). Can also be applied to cheerless fthrow (fsmash).",
            "desync": "Any situation or setup that involves having nana and popo acting independantly of one another, usually though buffering an input for one while the other is busy.",
            "cheerless": "If you get a synced grab with ICs, when you input a throw Nana will do a taunt (called cheer). This means she cannot act while you are throwing. Certain setups can allow you to get a cheerless throw, where Nana will be able to buffer an option as you throw, before she cheers. An example of this is the yeet.https://youtu.be/377qQF66n9M",
            "synced": "When nana and popo are synchronized, and are acting at the same time doing the same thing.",
            "semisync": "A state of being where nana will sometimes be under popo's control, and sometimes not. \nhttps://gfycat.com/MellowTerribleFawn",
            "belay": "ICs up special.",
            "blizz": "Blizzard - ICs down special.",
            "squall": "Squall Hammer - ICs side special.",
            "ib": "Ice Block/Ice Shot - ICs neutral special.",
            "heave-ho": "synced dthrow > uair. Kills in a narrow window.",
            "tilt turn": "The second hardest, and also second most useful neutral desync, second in both ways only to Blizzard Wavedash.\nhttps://twitter.com/v23God/status/1114949522256539648",
            "blizzard wavedash": "https://twitter.com/madmonk12345/status/1089084293241061378",
            "jab interrupt": "https://twitter.com/Savestate/status/1077064481233088512",
            "skid turn desync": "Skid turn desynch aka \"soymilk\": Dash in one direction until you enter run, then let go of the control stick to enter skid, then move the control stick in the opposite direction so Popo enters turn, and quickly interrupt the turning animation with any grounded move. If done correctly, Popo will perform the move and Nana will perform a short dash forward.\n\nTechnical details: Just like with other run turn desynchs, you have to input the move before Nana goes into turn so that she interprets the turn input as a dash forward. Out of skid, dash interrupts as early as frame 8. So you have to skid, turn, and then input a move at least 8 frames after the original skid, but less than 6 frames after the turn",
            "soymilk": "Skid turn desynch aka \"soymilk\": Dash in one direction until you enter run, then let go of the control stick to enter skid, then move the control stick in the opposite direction so Popo enters turn, and quickly interrupt the turning animation with any grounded move. If done correctly, Popo will perform the move and Nana will perform a short dash forward.\n\nTechnical details: Just like with other run turn desynchs, you have to input the move before Nana goes into turn so that she interprets the turn input as a dash forward. Out of skid, dash interrupts as early as frame 8. So you have to skid, turn, and then input a move at least 8 frames after the original skid, but less than 6 frames after the turn",
            "tom": "This is my tom. There are many like it, but this one is mine.\nMy tom is my best friend. It is my life. I must master it as I must master my life.\nWithout me, my tom is useless. Without my tom, I am useless. I must fire my tom true. I must shoot straighter than my enemy who is trying to kill me. I must shoot him before he shoots me. I will ...\nBefore God, I swear this creed. My tom and myself are the defenders of my country. We are the masters of our enemy. We are the saviors of my life.\nSo be it, until there is no enemy, but peace. Amen.",
            "gimfinite": "https://youtu.be/BCovjXUecDw",
            "corner carry": "Alternative name for Nut or any of its derivatives that carry the opponent to the corner for a cheerless conversion.",
            "ruri combo": "A solid conversion off of synced grab at mid percents. https://twitter.com/ruripikaics/status/1105443229095190529",
            "chars doc": "Doc that lists what specific things work on which characters, such as utilt (footstool squall), (utilt) footstool as an infinite, and the gimfinite. Work in progress, contact techy#5973 for editing access/corrections. https://docs.google.com/spreadsheets/d/1WI_xGi1OQ3b0bhrue42OqjrlufqYJQXM2m0FNil6-hw/edit#gid=0",
            "squall desync": "At the end of squall, you can buffer an option just for nana, and then buffer something for popo, so that they perform two different things. \nBasics: <https://twitter.com/v23God/status/1102950879672627207>\nTechnical Details: <https://www.youtube.com/watch?v=xVuxZxmc358>",
            "nanatrump": "While trumping is only mediocre for a lot of characters in this game, since the opponent can DI in or away from the stage and limit your options for directly punishing it, Ice Climbers has what is likely the best trump punishes in the game. The answer is to make nana trump the opponent, while immdiately hitting ledge with popo fsmash. This is called nanatrump.\nThere are two main ways to do this - \n1. Run towards ledge and pivot grab towards center stage right before you reach ledge. While popo is in the endlag from the pivot grab, you can trump with nana.\n2. You can jump towards ledge, and if you space your landing just right, nana will grab ledge but popo will land on stage.\n\nAs nana trumps the opponent, you must immediately fsmash the ledge with popo. If done properly, they will get hit by the fsmash immediately after breaking contact with the ledge, which guarantees the fsmash.\nExample: https://twitter.com/bigd_ssb/status/1086753626670809088",
            "dashgrab dashthrough": "If you initiate a dash, then wait 6 frames for nana to initiate her dash, and then grab an opponent during nana's initial dash animation, and continue to hold forward, nana will keep running (foxtrotting technically) forward  past popo until she is out of control range. Very similar to semisync, and technically this sets up a cheerless, though its uses are more limited. Near ledge, you can have nana walk to the ledge, which can set up a teeter cancel, if you are precise. Otherwise, you can have nana grab ledge, and then do the following - https://gfycat.com/marvelousobesecranefly",
            "teeter cancel": "If you can get nana to teeter on the edge of a platform or the main stage, you can guarantee a cheerless throw from it. Nana will not cheer if she is teetering when you throw someone. This can be setup\n1. in the same way that nanatrump is setup with whiff grab\n2. with a dash towards ledge\n3. airdodging onto a platform with the right timing\nExamples-<https://gfycat.com/DearElaborateAlaskanmalamute>\n<https://youtu.be/Yp69Y3gjSMk>",
            "shieldgrab jab": "Hold shield, and then whiff a shieldgrab with A, and continue to hold A. This will make nana jab by herself, leaving popo free to do something else while nana is jabbing. Example: https://gfycat.com/DefiantEdibleCowrie",
            "double uair": "If you do a short hop buffered uair, and then buffer another uair right before landing, Nana's uair will autocancel, and you can input something for nana right before you land, which popo will ignore. See also: bair uair\nexample (substitute bair for uair): https://gfycat.com/BlueFlimsyCod",
            "bair uair": "If you do a short hop buffered bair, and then buffer an uair right before landing, Nana's uair will autocancel, and you can input something for nana right before you land, which popo will ignore. See also: double uair\nexample: https://gfycat.com/BlueFlimsyCod",
            "izaw guide": "A beginners intro to a few useful ICs things. https://www.youtube.com/watch?v=Y2uVdqAVoUQ"
        },
        "data": {
            "name": "Ice Climbers",
            "server": "456665686966796299"
        }
    },
    "none": {
        "terms": {

        },
        "data": {
            "name": "none",
            "server": "none"
        }
    }
}
