{
    "general": {
        "terms": {
            "run cancel": { "id": 0, "content": "A Run Cancel allows you to use any move out of a run. It is performed by returning the Control Stick to the neutral (default) position, then performing any move." },
            "skid cancel": { "id": 1, "content": "A Skid Cancel, also known as RGR, is pretty much the grounded version of RAR. Due to SSBU's new dash mechanics, you can cancel a skid with any move. In turn, you can reverse your direction before any move during a dash." },
            "sh": { "id": 2, "content": "A Short Hop, or a SH, is performed in 2 ways in SSBU:\n\n1) Pushing the jump button, then releasing it before becoming airborne\n2) Buffering an aerial during the jump startup\n\nA SH is a shorter version of a normal jump, allowing you to hit grounded opponents and land quicker.\n\nAfter performing a SH in SSBU, your aerial damage will be reduced to 0.85x its original damage. This applies until you jump or touch the ground. It is currently unknown if this applies to specials. It is also unknown if hitting an aerial, performing a special, performing an aerial, or being hit resets this." },
            "faf": { "id": 3, "content": "FAF is the First Actionable Frame. It's basically the first frame you can perform an action during another one. For instance, if a move has a FAF of 24, the first frame you can act during it is frame 24, and the last frame you cannot act is frame 23." },
            "jmu": { "id": 4, "content": "A JMU is a __J__oint __M__atch__U__p. During one, 2 Smashcords come together to discuss the MU between their characters and is a great opportunity to learn! Each Smashcord does it differently - some structure theirs on a schedule and some don't, some end theirs with a crew battle and some don't, etc." },
            "oos": { "id": 5, "content": "OoS refers to your Out of Shield options, or the things you can do while shielding. These are, for any character:\n\n- Grab\n-Jump\n- JC USmash\n- JC Up Special\n- Any special used after a jump\n- Any aerial after a jump\n- Airdodge after a jump\n- Any move after a shield drop" },
            "rar": { "id": 6, "content": "RAR stands for Reverse Aerial Rush. It is performed by running in one direction, then holding behind you so that you skid while facing the opposite direction. Because you can cancel this animation with a jump, you can then jump and perform aerials. This allows you to approach with a Back Air or retreat with a Forward Air, etc." },
            "rar2": { "id": 7, "content": "RAR stands for Reverse Aerial Rush. It's a technique that exploits how the skid animation works; you can jump during a skid, allowing you to jump out of a dash facing the opposite direction you started. This is notably useful for moving forward using a Back Aerial." },
            "rgr": { "id": 8, "content": "RGR, also known as a Skid Cancel, stands for Reverse Grounded Rush. It's pretty much the grounded version of RAR. Due to SSBU's new dash mechanics, you can cancel a skid with any move. In turn, you can reverse your direction before any move during a dash." },
            "frame": { "id": 9, "content": "A frame is the smallest unit of time in Smash. There are 60 frames per second, and the speed of moves is usually measured in frames. For instance, in Smash 4, Little Mac's Jab 1 is Frame 1, which is instant. Mario's Jab 1 is Frame 2, which is almost instant, etc. The speed of a move is often abbreviated to Fx, where x is the frame the move comes out on. For example, Little Mac's Jab would be F1 and Mario's would be F2." },
            "runbrake": { "id": 10, "content": "RunBrake is the technical name for a skid. This occurs when you enter Run, then return the control stick to neutral. Not to be confused with a turnaround skid, also known as a pivot, or run turnaround." },
            "fh": { "id": 11, "content": "A Full Hop, or a FH, is the normal type of jump. It is performed when you do not buffer an aerial on your jump startup or you hold the jump button throughout your jump startup. Using a FH allows you to hit opponents on high platforms, hit opponents far above you, followup from certain moves, etc." },
            "aa": { "id": 12, "content": "An AA is an anti-air, and it's basically a move that counters an aerial approach. It is typically disjointed and/or has a high hitbox. A traditional fighting game example is Ryu's Heavy Kick or Shoryuken in Street Fighter. A Smash Bros example is Cloud's Cross Slash." },
            "rage": { "id": 13, "content": "Rage is a mechanic that increases the knockback dealt slightly by a fighter as their percent increases. It starts taking effect at 35% and gradually became stronger, maxing at 150%. It does not affect moves with WBKB (weight based knockback)." },
            "wbkb": { "id": 14, "content": "WBKB is short for Weight Based Knockback. It is essentially set knockback, and it only changes based on a character's weight, hence the name." },
            "sdi": { "id": 15, "content": "SDI is short for Smash Directional-Influence (oficially called hitstun shuffling). It is NOT DI (Directional Influence) and is a completely different mechanic. It is performed while pressing a direction repeatedly while in hitlag (also known as freeze frames). Each time you press a direction, you will move slightly in that direction **before** knockback. This allows you to escape multihit moves, such as rapid jabs.\n\nA more effective method in Smash 4 on the Gamecube Controller was to push the control stick to the notch of the direction you wanted to SDI in, then move it to the 2 notches beside it. For instance if you wanted to SDI up, you would do an input like this:\n\n⬆ ↖ ⬆ ↗ ⬆ \n\nIt is unknown if this is the most effective SDI method in SSBU." },
            "ledge grab limit": { "id": 16, "content": "https://www.youtube.com/watch?v=ZG-msKOIR9g" },
            "shac": { "id": 17, "content": "Short for ShortHop Autocancel. If a move can SHAC, it means it will autocancel in a shorthop. This is generally a good property for a move to have. See also: AC" },
            "hitstun shuffling": { "id": 18, "content": "Hitstun Shuffling is the offical name for SDI. See: sdi" },
            "knockback": { "id": 19, "content": "Knockback, abbreviated to KB, is the distance you travel when launched by a particular move. Two parts of KB are Base Knockback (BKB) and Knockback Growth (KBG). BKB is the base knockback amount that is always applied at any percent. KBG is a modifier that affects how far you are sent by an attack at higher percents." },
            "zac": { "id": 20, "content": " A Z-drop Aerial Catch or ZAC, is performed by pressing grab while in the air to z-drop an item (like bombs), and then immediately inputting an aerial, which will recatch the bomb. The result will be a somewhat delayed aerial while holding a bomb. This can allow for some more unique combo potential." },
            "ff": { "id": 21, "content": "Fastfall, sometimes shortened to FF, is when you press down on the control stick after reaching the peak of your jump. This will result in you falling faster than you normally would." },
            "ac": { "id": 22, "content": "An Autocancel is where a move can land with zero endlag. Most moves have an aucocancel window before the move comes out, and after the move has completed. If you land during this period, you will land without lag. Example: Link dair from very high up can land with no endlag, but if you try to dair close to the ground you will have a noticable amount of lag." },
            "b reverse": { "id": 23, "content": "A B-reverse happens when you do a Special move (such as side-B), and then immediately press the control stick in the opposite direction that you are facing. This will shift all your momentum from the original direction of travel into the new direction. Not all special moves can do this and get the momentum shift. See also: wavebounce, turnaroundspecial" },
            "turnaround special": { "id": 24, "content": "A Turnaround Special is performed by  pressing left or right before initiating a special move. This will result in a special move facing the new direction, with no shift in momentum. See also: breverse, wavebounce" },
            "wavebounce": { "id": 25, "content": "A Wavebounce combines the effects of a B-Reverse and a Turnaround Special. If you move to the right, for example, and do a turnaround Shorthop Lucas PK Fire to the left, but immediately input to the right after inputting the special, you will end up 'bouncing' back to the left, while shooting right. The inputs for this are jump to the right > left special > right. The timing for this is precise, and requires practice to perform reliably. See also: breverse, turnaroundspecial" },
            "dad": { "id": 26, "content": "Directional Airdodge. Press airdodge while pressing in a direction." },
            "waveland": { "id": 27, "content": "A Waveland is where you airdodge down into a platform or the ground to land more quickly. The name is related to a wavedash, as both can end with you sliding on the ground." }
        },
        "data": {
            "name": "general",
            "server": "all"
        }
    },
    "Isabelle": {
        "terms": {
            "moveset doc": { "id": 0, "content": "https://docs.google.com/document/d/1odjhW1IWnWmhXSZ74K6BynElw8FTZfE6oTo_Cf_x0RU/edit?usp=sharing" }
        },
        "data": {
            "name": "Isabelle",
            "server": "489939754021027841"
        }
    },
    "Young Link": {
        "terms": {
            "c4": { "id": 0, "content": "C4 is placing a bomb in a way that it lies on the ground with exploding. You can do this by performing either a forward toss or back toss. You can also perform it by z-dropping the bomb right after jumping or right before landing." },
            "gsa": { "id": 1, "content": "A gSA is a Grounded Spin Attack. When grounded, Spin Attack is a multi-hit move that acts as a combo starter. Its main followup is Uair, which can be a kill confirm within a percent range." },
            "asa": { "id": 2, "content": "An aSA is an Aerial Spin Attack. When aerial, Spin Attack is a multi-hit move that acts as a KO move. It can kill off the side, and its main setup is off of a Bomb." },
            "soft toss": { "id": 3, "content": "A soft toss is where you toss a bomb that does not explode upon hitting the ground, but rather does a little bounce and then sits there, as an item, until it explodes. This is performed by simply tossing a bomb with no directional input in front of you. To soft toss behind you, you can press tilt stick behind you, if you have the cstick set to tilt. This can be useful for a number of reasons. Our relatively short bomb timer can remain as a threat to players who are not actively keeping up with its explosion timer. In addition, if you space yourself perfectly, you can soft toss a bomb such that it bounces right off the edge of the stage, and then falls almost straight down, which can sometimes stage spike." }
            
        },
        "data": {
            "name": "Young Link",
            "server": "456487360624984076"
        }
    },
    "Pichu": {
        "terms": {
            "pichu analysis": { "id": 0, "content": "https://docs.google.com/document/d/1K7McATah0unA3eS8YAJylicLSthcl-pwXyLiPxp5OaE/edit" }
        },
        "data": {
            "name": "Pichu",
            "server": "421442870864510976"
        }
    },
    "none": {
        "terms": {

        },
        "data": {
            "name": "none",
            "server": "none"
        }
    }
}
